In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("transactions.csv")

In [3]:
df.head()

,t_date,cust_id,t_amt,services,products_used,city,state,t_details
0,06-26-2015,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit
1,05-26-2015,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit
2,06-01-2015,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit
3,06-05-2015,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit
4,12-17-2015,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   t_date         50000 non-null  object
 1   cust_id        50000 non-null  int64
 2   t_amt          50000 non-null  float64
 3   services       50000 non-null  object
 4   products_used  50000 non-null  object
 5   city           50000 non-null  object
 6   state          50000 non-null  object
 7   t_details      50000 non-null  object
dtypes: float64(1), int64(1), object(6)
memory usage: 3.1+ MB

In [5]:
df.isnull().sum()

t_date           0
cust_id          0
t_amt            0
services         0
products_used    0
city             0
state            0
t_details        0
dtype: int64

In [6]:
df.describe()

            cust_id         t_amt
count  5.000000e+04  50000.000000
mean   4.005007e+06    102.216411
std    2.878243e+03     56.651455
min    4.000000e+06      5.000000
25%    4.002525e+06     53.070000
50%    4.005028e+06    101.750000
75%    4.007477e+06    151.440000
max    4.009999e+06    200.000000

In [7]:
df['t_date'] = pd.to_datetime(df['t_date'], format='%m-%d-%Y', errors='coerce')

In [8]:
df['month'] = df['t_date'].dt.to_period('M').astype(str)
df['quarter'] = df['t_date'].dt.to_period('Q').astype(str)

In [9]:
df

,t_date,cust_id,t_amt,services,products_used,city,state,t_details,month,quarter
0,2015-06-26,4007024,40.33,Exercise & Fitness,Cardio Machine Accessories,Clarksville,Tennessee,credit,2015-06,2015Q2
1,2015-05-26,4006742,198.44,Exercise & Fitness,Weightlifting Gloves,Long Beach,California,credit,2015-05,2015Q2
2,2015-06-01,4009775,5.58,Exercise & Fitness,Weightlifting Machine Accessories,Anaheim,California,credit,2015-06,2015Q2
3,2015-06-05,4002199,198.19,Gymnastics,Gymnastics Rings,Milwaukee,Wisconsin,credit,2015-06,2015Q2
4,2015-12-17,4002613,98.81,Team Sports,Field Hockey,Nashville,Tennessee,credit,2015-12,2015Q4
...,...,...,...,...,...,...,...,...,...,...
49995,2015-09-18,4005664,53.95,Games,Dice Games,Irving,Texas,credit,2015-09,2015Q3
49996,2015-10-02,4007287,163.81,Games,Poker Chips & Sets,Kansas City,Missouri,credit,2015-10,2015Q4
49997,2015-05-03,4003954,35.85,Racquet Sports,Squash,New Orleans,Louisiana,cash,2015-05,2015Q2
49998,2015-10-23,4007843,180.41,Gymnastics,Vaulting Horses,Berkeley,California,credit,2015-10,2015Q4
49999,2015-12-14,4001406,168.49,Team Sports,Team Handball,Rockford,Illinois,credit,2015-12,2015Q4

In [10]:
df.columns

Index(['t_date', 'cust_id', 't_amt', 'services', 'products_used', 'city',
       'state', 't_details', 'month', 'quarter'],
      dtype='object')

In [11]:
# 1. Total sales amount across all transactions
total_sales = df['t_amt'].sum()
total_sales

np.float64(5110820.54)

In [12]:
# 2. Month with highest total transaction amount
month_sales = df.groupby('month', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_sales'})
highest_month = month_sales.loc[month_sales['total_sales'].idxmax()]
month_sales
highest_month

month            2015-03
total_sales    444664.24
Name: 2, dtype: object

In [13]:
#3. Average transaction amount per customer
avg_amt_per_customer = df.groupby('cust_id')['t_amt'].mean().mean()
avg_amt_per_customer

np.float64(101.97791991921538)

In [14]:
# 4. Trend of total sales over months (use month_sales already)
trend = month_sales.sort_values('month')
trend

      month  total_sales
0   2015-01    438165.76
1   2015-02    395262.37
2   2015-03    444664.24
3   2015-04    420695.24
4   2015-05    432627.58
5   2015-06    421074.55
6   2015-07    439560.80
7   2015-08    434255.01
8   2015-09    429321.63
9   2015-10    424856.28
10  2015-11    408846.35
11  2015-12    421490.73

In [15]:
# 5. Highest single transaction amount
max_transaction = df['t_amt'].max()
max_transaction

200.0

In [16]:
# 6. Service category contributes most to total revenue
service_revenue = df.groupby('services', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_revenue'})
top_service = service_revenue.loc[service_revenue['total_revenue'].idxmax()]
service_revenue
top_service

services         Outdoor Recreation
total_revenue             846678.64
Name: 9, dtype: object

In [17]:
# 7. Product generated highest revenue
product_revenue = df.groupby('products_used', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_revenue'})
top_product = product_revenue.loc[product_revenue['total_revenue'].idxmax()]
product_revenue
top_product

products_used    Yoga & Pilates
total_revenue          47804.94
Name: 124, dtype: object

In [18]:
# 8. Average transaction amount varies between services
avg_by_service = df.groupby('services', as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})
avg_by_service

                  services  avg_transaction
0               Air Sports       103.455104
1            Combat Sports       101.061761
2                  Dancing       102.907512
3       Exercise & Fitness       103.660247
4                    Games       102.272968
5               Gymnastics       102.385901
6             Indoor Games       103.074684
7                  Jumping       102.155171
8   Outdoor Play Equipment       101.281196
9       Outdoor Recreation       100.999480
10                 Puzzles       100.595997
11          Racquet Sports       103.647461
12             Team Sports       102.738998
13            Water Sports       101.899975
14           Winter Sports       101.217718

In [19]:
# 9. Unique customers
unique_customers = df['cust_id'].nunique()
unique_customers

9926

In [20]:
# 10. Customers spent most overall (top 10)
top_customers = df.groupby('cust_id', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_spent'})\
                  .sort_values('total_spent', ascending=False).head(10)
top_customers

      cust_id  total_spent
9415  4009485      1973.30
6368  4006425      1732.09
220   4000221      1671.47
3200  4003228      1640.63
6548  4006606      1628.94
6410  4006467      1605.95
4885  4004927      1576.71
8258  4008321      1560.79
809   4000815      1557.82
1044  4001051      1488.67

In [21]:
# 11. Average number of transactions per customer
avg_txn_per_customer = df.groupby('cust_id').size().mean()
avg_txn_per_customer

np.float64(5.037275841225066)

In [22]:
# 12. Customers who made multiple purchases in different categories (services)
cust_service_count = df.groupby('cust_id')['services'].nunique()
multi_category_customers = (cust_service_count > 1).sum()
cust_service_count
multi_category_customers

np.int64(9488)

In [23]:
# 13. % of customers repeat buyers (more than 1 transaction)
repeat_buyers = (df.groupby('cust_id').size() > 1).mean() * 100
repeat_buyers

np.float64(96.5645778762845)

In [24]:
# 14. Product category highest total sales (same as products_used)
top_product_category = top_product
top_product_category

products_used    Yoga & Pilates
total_revenue          47804.94
Name: 124, dtype: object

In [25]:
# 15. Most popular services by transaction count
service_popularity = df['services'].value_counts().reset_index()
service_popularitys=service_popularity.columns = ['services', 'transaction_count']
service_popularity

                  services  transaction_count
0       Outdoor Recreation               8383
1       Exercise & Fitness               7394
2              Team Sports               6010
3             Water Sports               5219
4                    Games               3666
5               Gymnastics               3196
6            Winter Sports               3181
7   Outdoor Play Equipment               2910
8             Indoor Games               2799
9                  Jumping               2015
10           Combat Sports               1630
11          Racquet Sports               1611
12              Air Sports                960
13                 Puzzles                612
14                 Dancing                414

In [26]:
# 16. For each service, product type purchased most frequently
service_product_freq = df.groupby(['services', 'products_used']).size().reset_index(name='count')
idx = service_product_freq.groupby('services')['count'].idxmax()
most_freq_product_by_service = service_product_freq.loc[idx].sort_values('services')
most_freq_product_by_service

                   services               products_used  count
2                Air Sports                  Parachutes    400
3             Combat Sports                      Boxing    431
7                   Dancing                 Ballet Bars    414
9        Exercise & Fitness  Cardio Machine Accessories    445
32                    Games                     Mahjong    437
35               Gymnastics               Balance Beams    425
47             Indoor Games                    Foosball    422
54                  Jumping                 Trampolines    421
60   Outdoor Play Equipment                  Swing Sets    464
73       Outdoor Recreation                  Lawn Games    466
83                  Puzzles              Jigsaw Puzzles    397
85           Racquet Sports                   Badminton    413
97              Team Sports                      Hockey    434
105            Water Sports                Bodyboarding    425
118           Winter Sports        Cross-Country Skiing    429

In [27]:
# 17. Average transaction amount per product type
avg_by_product = df.groupby('products_used', as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})
avg_by_product

           products_used  avg_transaction
0    Abdominal Equipment       105.362798
1             Air Hockey       103.775478
2              Air Suits       101.421832
3                Archery        97.345564
4              Badminton       108.441138
..                   ...              ...
120             Wetsuits       102.042775
121   Whitewater Rafting       102.877744
122          Windsurfing       104.161453
123            Wrestling        97.895364
124       Yoga & Pilates       107.668784

[125 rows x 2 columns]

In [28]:
# 18. Services where customers spend significantly more (use avg and total)

In [29]:
# 19. State highest total sales
state_sales = df.groupby('state', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_sales'})
top_state = state_sales.loc[state_sales['total_sales'].idxmax()]
top_state

state          California
total_sales     702346.23
Name: 2, dtype: object

In [30]:
# 20. City highest number of transactions
city_txn = df['city'].value_counts().reset_index()
city_txn.columns = ['city','transaction_count']
top_city = city_txn.iloc[0]
top_city

city                 Pasadena
transaction_count         939
Name: 0, dtype: object

In [31]:
# 21. Average spending per transaction in each state
avg_spend_state = df.groupby('state', as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})
avg_spend_state

                   state  avg_transaction
0                Alabama       102.487049
1                Arizona       102.172241
2             California       102.652182
3               Colorado       101.537415
4            Connecticut        99.982108
5   District of Columbia       103.800334
6                Florida       103.136567
7                Georgia       102.330675
8                 Hawaii       101.536667
9                  Idaho        98.969538
10              Illinois       100.166315
11               Indiana       100.712664
12                  Iowa       103.100727
13                Kansas       101.436926
14              Kentucky       104.130392
15             Louisiana       103.466335
16              Maryland       100.506913
17         Massachusetts       104.541571
18              Michigan       101.547777
19             Minnesota       103.465157
20           Mississippi       101.214926
21              Missouri       100.969040
22              Nebraska       101.955690
23                Nevada       105.434718
24            New Jersey       103.438005
25              New York       100.259452
26        North Carolina       103.033172
27                  Ohio       101.350817
28              Oklahoma       104.995771
29                Oregon       102.438143
30          Pennsylvania       102.776034
31        South Carolina       103.540065
32             Tennessee        99.265804
33                 Texas       101.379891
34                  Utah       104.507560
35              Virginia       104.976206
36            Washington       101.401603
37             Wisconsin       101.953159

In [32]:
# 22. Services more popular in specific states (top service per state)

In [33]:
# 23. States buy most Outdoor Recreation products
outdoor = df[df['services'].str.contains('Outdoor', case=False, na=False) | df['products_used'].str.contains('Outdoor', case=False, na=False)]
outdoor_state_sales = outdoor.groupby('state', as_index=False)['t_amt'].sum().sort_values('t_amt', ascending=False)
outdoor_state_sales

                   state      t_amt
2             California  164678.43
33                 Texas  113499.72
6                Florida   65548.76
29                Oregon   43896.68
32             Tennessee   41050.25
27                  Ohio   40122.52
36            Washington   38311.86
3               Colorado   37023.68
17         Massachusetts   34506.02
1                Arizona   30917.51
21              Missouri   30203.01
10              Illinois   30068.88
35              Virginia   28703.46
24            New Jersey   28224.93
37             Wisconsin   26070.03
0                Alabama   24652.93
31        South Carolina   22188.66
19             Minnesota   21770.21
7                Georgia   21347.30
14              Kentucky   21330.63
13                Kansas   20888.83
34                  Utah   20612.26
30          Pennsylvania   20523.62
26        North Carolina   20410.81
25              New York   19780.45
22              Nebraska   19709.75
23                Nevada   19668.83
4            Connecticut   19620.10
18              Michigan   19515.13
11               Indiana   12616.44
15             Louisiana   12499.38
5   District of Columbia   10848.64
16              Maryland   10709.94
9                  Idaho   10503.88
20           Mississippi   10399.19
8                 Hawaii   10273.70
28              Oklahoma    9421.47
12                  Iowa    9289.03

In [34]:
# 24. Compare average spending between California and Texas customers
ca_tx = df[df['state'].isin(['California','Texas'])]
avg_by_state_ca_tx = ca_tx.groupby('state', as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})
avg_by_state_ca_tx

        state  avg_transaction
0  California       102.652182
1       Texas       101.379891

In [35]:
# 25. Quarter highest sales
quarter_sales = df.groupby('quarter', as_index=False)['t_amt'].sum().rename(columns={'t_amt':'total_sales'})
top_quarter = quarter_sales.loc[quarter_sales['total_sales'].idxmax()]
top_quarter

quarter            2015Q3
total_sales    1303137.44
Name: 2, dtype: object

In [36]:
# 27. Total number of transactions per month
txn_per_month = df.groupby('month').size().reset_index(name='transactions').sort_values('month')
txn_per_month

      month  transactions
0   2015-01          4268
1   2015-02          3834
2   2015-03          4360
3   2015-04          4175
4   2015-05          4205
5   2015-06          4171
6   2015-07          4252
7   2015-08          4250
8   2015-09          4160
9   2015-10          4181
10  2015-11          3994
11  2015-12          4150

In [37]:
# 28. Season when sports equipment sales spike (Team Sports + Exercise & Fitness + Gymnastics)

In [38]:
# 29. How many transactions using credit
credit_txn_count = (df['t_details'].str.lower() == 'credit').sum()
credit_txn_count

np.int64(43151)

In [39]:
# 30. Total revenue from credit transactions
credit_revenue = df.loc[df['t_details'].str.lower()=='credit', 't_amt'].sum()
credit_revenue

np.float64(4923134.930000001)

In [40]:
# 31. Difference in average spending between credit and debit
avg_by_payment = df.groupby(df['t_details'].str.lower(), as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})
avg_by_payment

C:\Users\krish\AppData\Local\Temp\ipykernel_8376\4244355837.py:2: FutureWarning: A grouping was used that is not in the columns of the DataFrame and so was excluded from the result. This grouping will be included in a future version of pandas. Add the grouping as a column of the DataFrame to silence this warning.
  avg_by_payment = df.groupby(df['t_details'].str.lower(), as_index=False)['t_amt'].mean().rename(columns={'t_amt':'avg_transaction'})

   avg_transaction
0        27.403360
1       114.090865